app/Controllers/AdminController.php

    public function lista()
    {
        $data['titulo'] = 'Administración de Productos';

         $productoModel = new ProductoModel();


        $productoModel->select('productos.*, categorias.nombre as categoria_nombre, sub_categorias.nombre as subcategoria_nombre')
              ->join('categorias', 'categorias.id = productos.categoria_id', 'left')
              ->join('sub_categorias', 'sub_categorias.id = productos.subcategoria_id', 'left')
              ->where('productos.eliminado', 'NO');

        $data['productos'] = $productoModel->findAll();
---
SELECT `productos`.*, `categorias`.`nombre` as `categoria_nombre`, `sub_categorias`.`nombre` as `subcategoria_nombre`
FROM `productos`
LEFT JOIN `categorias` ON `categorias`.`id` = `productos`.`categoria_id`
LEFT JOIN `sub_categorias` ON `sub_categorias`.`id` = `productos`.`subcategoria_id`
WHERE `productos`.`eliminado` = 'NO'

    public function alta(){
        $data['titulo'] = 'Alta de Productos';

        $categoriasModel = new CategoriasModel();
        $data['categorias'] = $categoriasModel->findAll();

        $subcategoriasModel = new SubCategoriasModel();
        $data['subcategorias'] = $subcategoriasModel->findAll();
---
SELECT *
FROM `categorias`
SELECT *
FROM `sub_categorias`



        $nuevoProducto = new ProductoModel();
        $nuevoProducto->insert($data);
---
INSERT INTO `productos` (`nombre_producto`, `imagen_producto`, `categoria_id`, `subcategoria_id`, `precio`, `marca`, `stock`, `descripcion`, `eliminado`) VALUES ('Auriculares Bluetooth', 'assets/img/1750383428_71bd3a06d1b321d131cb.png', '2', '1', '50000', 'JBL', '15', 'Auriculares Inalambricos JBL para Celulares', 'NO')

            $categoriasModel = new CategoriasModel();
            $subcategoriasModel = new SubCategoriasModel();

            $data['categorias'] = $categoriasModel->findAll();
---
SELECT *
FROM `sub_categorias`

    public function eliminados(){
        $productoModel = new ProductoModel();
        $data['productos'] = $productoModel->where('eliminado', 'SI')->findAll();
---
SELECT *
FROM `productos`
WHERE `eliminado` = 'SI'