app/Controllers/LoginController.php

SELECT *
FROM `usuarios`
WHERE `mail` = 'sda@123.com'
 LIMIT 1
---
    public function auth(){

        $session = session();
        $model = new UsuariosModel();

        $mail = $this->request->getVar('mail');
        $password = $this->request->getVar('pass');

        $data = $model->where('mail', $mail)->first();