app/Models/Detalle_ventasModel.php

SELECT `detalle_venta`.*, `productos`.`nombre_producto`, `venta`.`id_cliente`, `venta`.`fecha_venta`, CONCAT(usuarios.apellido, ' ', usuarios.nombre) AS nombre_completo
FROM `detalle_venta`
JOIN `productos` ON `productos`.`id` = `detalle_venta`.`id_producto`
JOIN `venta` ON `venta`.`id_ventas` = `detalle_venta`.`venta_id`
JOIN `usuarios` ON `usuarios`.`id` = `venta`.`id_cliente`
---
   public function detallesProducto()
{
    return $this->select('detalle_venta.*, productos.nombre_producto, venta.id_cliente, venta.fecha_venta, CONCAT(usuarios.apellido, \' \', usuarios.nombre) AS nombre_completo')
                ->join('productos', 'productos.id = detalle_venta.id_producto')
                ->join('venta', 'venta.id_ventas = detalle_venta.venta_id')
                ->join('usuarios', 'usuarios.id = venta.id_cliente')
                ->findAll();